class CompanyInfo {
  String companyName = "Nein to Sick";
  String ceo = "김형진";
  String address = "경상북도 포항시 북구 흥해읍 한동로 558 (한동대학교) SW라운지 303";
  String pn = "010-6889-9316";
  String email = "neintosick96@gmail.com";

  List<List<String>> termsOfUse = [
    [
      "제1조: 총칙",
      "1. \"하루\" 앱(이하 \"앱\"이라 함)은 사용자에게 마음을 관리하고 일상을 조직하는 데 도움을 주는 서비스를 제공합니다.\n2. 본 이용약관은 앱 이용자(이하 \"사용자\"라 함)와 앱 운영자 사이의 권리와 의무, 책임 등을 규정합니다.\n3. 앱을 사용함으로써 사용자는 본 이용약관에 동의한 것으로 간주됩니다."
    ],
    [
      "제2조: 서비스의 제공",
      "1. 앱은 사용자에게 다음과 같은 서비스를 제공합니다:\n- 마음 상태 기록 기능\n  - 일정 관리 및 알림 기능\n  - 목표 설정 및 추적 기능\n  - 사용자 커뮤니티 기능\n  - 기타 앱에서 추가로 제공하는 서비스\n2. 앱은 서비스의 내용을 추가, 변경, 중단할 수 있으며, 이에 대한 사전 고지나 동의를 얻을 수 있습니다."
    ],
    [
      "제3조: 사용자의 의무",
      "1. 사용자는 앱을 이용함에 있어 다음 사항을 준수해야 합니다:\n  - 본인의 실명과 정확한 정보를 제공해야 합니다.\n  - 앱의 서비스를 부정하게 이용하거나 제3자의 개인정보를 무단으로 수집, 사용, 공개하지 않아야 합니다.\n  - 앱의 운영에 방해되는 행위를 하여서는 안 됩니다.\n2. 사용자는 자신의 계정 정보를 안전하게 관리해야 합니다. 앱은 사용자의 부주의나 비밀번호 유출로 인한 피해에 대해 책임을 지지 않습니다."
    ],
    [
      "제4조: 개인정보 보호",
      "앱은 사용자의 개인정보를 관리하기 위해 개인정보 처리방침을 따릅니다. 개인정보의 수집, 이용, 보호 등에 대한 내용은 개인정보 처리방침에서 자세히 설명됩니다."
    ],
    [
      "제5조: 책임 제한",
      "1. 앱은 사용자가 제3자와의 거래나 교류 등을 통해 발생한 손해에 대해 어떠한 책임도 지지 않습니다.\n2.앱은 천재지변, 시스템 장애, 서비스 중단 등 부득이한 사유로 인해 발생한 서비스 제공 중단 또는 손해에 대해 책임을 지지 않습니다."
    ],
    [
      "제6조: 권리의 귀속",
      "1. 앱은 서비스를 위한 소프트웨어, 디자인, 로고 등 지적 재산권을 보유합니다.\n2. 사용자는 앱에서 제공하는 서비스를 개인적인 목적으로만 사용할 수 있으며, 상업적인 목적으로 이를 사용하거나 재판매, 양도, 변경하는 행위는 금지됩니다."
    ],
    [
      "제7조: 이용계약의 종료",
      "1. 사용자는 언제든지 앱 서비스 이용을 중단하고 이용계약을 해지할 수 있습니다.\n2. 앱은 사용자가 본 이용약관을 위반하거나 앱 운영에 방해가 되는 경우, 사용자의 서비스 이용을 제한하거나 이용계약을 해지할 수 있습니다."
    ],
    [
      "제8조: 준거법 및 재판관할",
      "본 이용약관은 대한민국의 법령에 따라 해석되고 적용되며, 앱과 사용자 간의 분쟁에 대한 관할은 대한민국 법원으로 합니다."
    ],
  ];

  List<List<String>> privacyPolicy = [
    [
      "제1조",
      "개인정보 처리의 목적 하루 앱은 사용자에게 마음을 관리하고 일상을 조직하는 데 도움을 주는 애플리케이션입니다. 개인정보 처리의 주요 목적은 다음과 같습니다:\n  - 사용자의 식별 및 인증\n  - 개인화된 서비스 제공\n  - 서비스 개선 및 확장\n  - 문의 사항 및 요청에 대한 응답"
    ],
    [
      "제2조",
      "수집하는 개인정보의 종류 하루 앱은 다음과 같은 개인정보를 수집할 수 있습니다:\n  - 사용자 이름: 사용자를 식별하고 앱 내에서 개인화된 경험을 제공하기 위해 수집됩니다.\n  - 이메일 주소: 계정 관리와 알림 서비스를 위해 수집됩니다.\n  - 비밀번호: 계정 보안을 유지하기 위해 암호화되어 저장됩니다.\n  - 프로필 사진: 사용자가 선택한 경우 프로필에 표시됩니다."
    ],
    [
      "제3조",
      "개인정보의 이용 하루 앱은 다음과 같은 목적으로 개인정보를 이용합니다:\n  - 사용자 식별 및 인증: 사용자를 식별하고 앱 서비스에 접근할 수 있도록 합니다.\n  - 개인화된 서비스 제공: 사용자의 선호 및 관심사에 맞는 컨텐츠 및 기능을 제공합니다.\n  - 서비스 개선 및 확장: 사용자의 피드백 및 앱 사용 패턴을 분석하여 서비스를 개선하고 새로운 기능을 개발합니다.\n  - 문의 사항 및 요청에 대한 응답: 사용자의 문의 사항에 대한 답변이나 요청 처리를 위해 개인정보를 사용할 수 있습니다.\n\n  a. 개인정보의 보유 및 삭제 하루 앱은 사용자의 개인정보를 서비스 이용 기간 동안 보유합니다. 사용자가 앱 서비스를 해지하거나 개인정보 삭제를 요청한 경우, 해당 개인정보는 즉시 삭제되거나 파기됩니다.\n  b. 개인정보의 제공 및 공유 하루 앱은 사용자의 개인정보를 제3자와 공유하지 않습니다. 다만, 법률에 의거하거나 사용자의 동의가 있는 경우에는 예외적으로 제3자와 개인정보를 공유할 수 있습니다.\n  c. 개인정보의 보안 하루 앱은 사용자의 개인정보를 보호하기 위해 관련 법률 및 보안 절차를 준수합니다. 암호화된 통신 채널을 통해 개인정보를 전송하고, 보안 시스템을 사용하여 개인정보에 대한 접근과 무단 사용을 방지합니다.\n  d. 개인정보 관련 권리 사용자는 개인정보에 대한 일정한 권리를 가지고 있습니다. 개인정보의 열람, 수정, 삭제를 요청할 수 있으며, 개인정보 처리에 대한 동의 철회도 가능합니다. 이러한 권리를 행사하기 위해서는 하루 앱의 개인정보 관련 문의 채널을 이용하시기 바랍니다.\n  e. 개인정보 처리방침의 변경 하루 앱은 개인정보 처리방침을 개정할 수 있습니다. 개인정보 처리방침의 변경 시 앱 내 알림을 통해 사용자에게 공지하고, 변경된 내용을 공개합니다."
    ],
  ];

  String privacyPolicyExplain =
      "위 개인정보 처리방침은 하루 앱에서 수집하는 개인정보에 대한 설명과 사용 방법을 안내하기 위한 것입니다. 사용자는 앱 서비스 이용 전에 본 개인정보 처리방침을 주의 깊게 읽고 동의 여부를 결정할 수 있습니다.";
}
